zx568073531/stm32f429_pjsip/Middlewares/CycloneTCP_SSL_SSH_CRYPTO_Open_2_1_4/third_party/silabs/emlib/src/em_lesense.c
#if defined(_SILICON_LABS_32B_SERIES_2)
  if (LESENSE->EN != 0U) {
    enabled = true;
    /* Wait for synchronization before writing to EN register */
    while (LESENSE->SYNCBUSY) {
      /* Wait for all synchronizations to finish */
    }
    /* Disable LESENSE module */
    LESENSE->EN_CLR = LESENSE_EN_EN;
    while (LESENSE->EN & _LESENSE_EN_DISABLING_MASK) {
      /* Wait for disabling to finish */
    }
  }
#endif

  /* A channel-specific timing configuration on the scan channel chIdx.
   * Setting excitation time, sampling delay, and measurement delay. */
  LESENSE->CH[chIdx].TIMING =
    ((uint32_t)exTime        << _LESENSE_CH_TIMING_EXTIME_SHIFT)
    | ((uint32_t)sampleDelay << _LESENSE_CH_TIMING_SAMPLEDLY_SHIFT)
    | ((uint32_t)measDelay   << _LESENSE_CH_TIMING_MEASUREDLY_SHIFT);

#if defined(_SILICON_LABS_32B_SERIES_2)
  /* Re-Enable LESENSE module if it was enabled in the first place. */
  if (enabled == true) {
    LESENSE->EN_SET = LESENSE_EN_EN;
  }
#endif
}

/***************************************************************************//**
 * @brief
 *   Set LESENSE channel threshold parameters.
 *
 * @details
 *   Use this function to set threshold parameters on a selected LESENSE
 *   channel.
 *
 * @note
 *   Users can configure the channel threshold parameters with the
 *   LESENSE_ChannelConfig() function, but only with a significant overhead.
 *   This simple function serves controls these parameters
 *   after the channel has been configured.
 *
 * @param[in] chIdx
 *   An identifier of the scan channel. A valid range is 0-15.
 *
 * @param[in] acmpThres
 *   ACMP threshold.
 *   @li If perCtrl.dacCh0Data or perCtrl.dacCh1Data is set to
 *   #lesenseDACIfData, acmpThres defines the 12-bit DAC data in the
 *   corresponding data register of the DAC interface (DACn_CH0DATA and
 *   DACn_CH1DATA). In this case, the valid range is 0-4095 (12 bits).
 *
 *   @li If perCtrl.dacCh0Data or perCtrl.dacCh1Data is set to
 *   lesenseACMPThres, acmpThres defines the 6-bit Vdd scaling factor of ACMP
 *   negative input (VDDLEVEL in ACMP_INPUTSEL register). In this case, the
 *   valid range is 0-63 (6 bits).
 *
 * @param[in] cntThres
 *   A decision threshold for counter comparison.
 *   A valid range is 0-65535 (16 bits).
 ******************************************************************************/
void LESENSE_ChannelThresSet(uint8_t chIdx,
                             uint16_t acmpThres,
                             uint16_t cntThres)
{
  uint32_t tmp; /* A temporary storage */
#if defined(_SILICON_LABS_32B_SERIES_2)
  bool enabled = false;
#endif

  /* A sanity check for acmpThres only, cntThres is a 16 bit value. */
  EFM_ASSERT(acmpThres < 4096U);
  /* A sanity check for the LESENSE channel ID. */
  EFM_ASSERT(chIdx < LESENSE_NUM_CHANNELS);

#if defined(_SILICON_LABS_32B_SERIES_2)
  if (LESENSE->EN != 0U) {
    enabled = true;
    /* Wait for synchronization before writing to EN register */
    while (LESENSE->SYNCBUSY) {
      /* Wait for all synchronizations to finish */
    }
    /* Disable LESENSE module */
    LESENSE->EN_CLR = LESENSE_EN_EN;
    while (LESENSE->EN & _LESENSE_EN_DISABLING_MASK) {
      /* Wait for disabling to finish */
    }
  }
#endif

  /* Save the INTERACT register value of channel chIdx to tmp.
   * Be aware of the effects of the non-atomic Read-Modify-Write cycle. */
  tmp = LESENSE->CH[chIdx].INTERACT & ~(0xFFF);
  /* Set the ACMP threshold value to the INTERACT register of the channel chIdx. */
  tmp |= (uint32_t)acmpThres;
  /* Write the new value to the INTERACT register. */
  LESENSE->CH[chIdx].INTERACT = tmp;

#if defined(_SILICON_LABS_32B_SERIES_0) || defined(_SILICON_LABS_32B_SERIES_1)
  /* Save the EVAL register value of channel chIdx to tmp.
   * Be aware of the effects of the non-atomic Read-Modify-Write cycle. */
  tmp = LESENSE->CH[chIdx].EVAL & ~(_LESENSE_CH_EVAL_COMPTHRES_MASK);
  /* Set the counter threshold value to the INTERACT register of the channel chIdx. */
  tmp |= (uint32_t)cntThres << _LESENSE_CH_EVAL_COMPTHRES_SHIFT;
  /* Write the new value to the EVAL register. */
  LESENSE->CH[chIdx].EVAL = tmp;
#else

  LESENSE->EN_SET = LESENSE_EN_EN;

  LESENSE->CH[chIdx].EVALTHRES = (uint32_t)cntThres << _LESENSE_CH_EVALTHRES_EVALTHRES_SHIFT;

  while (LESENSE->SYNCBUSY) {
    /* Wait for all synchronizations to finish */
  }
  if (!enabled) {
    /* Disable LESENSE module */
    LESENSE->EN_CLR = LESENSE_EN_EN;
    while (LESENSE->EN & _LESENSE_EN_DISABLING_MASK) {
      /* Wait for disabling to finish */
    }
  }

#endif
}

#if defined(_LESENSE_CH_EVAL_MODE_MASK) || defined(_SILICON_LABS_32B_SERIES_2)
/***************************************************************************//**
 * @brief
 *   Configure a Sliding Window evaluation mode for a specific channel.
 *
 * @details
 *   This function will configure the evaluation mode, the initial
 *   sensor measurement (COMPTHRES), and the window size. For other channel-related
 *   configuration, see the @ref LESENSE_ChannelConfig() function.
 *
 * @warning
 *   Note that the step size and window size configuration are global to all
 *   LESENSE channels and use the same register field in the hardware. This
 *   means that any windowSize configuration passed to this function will
 *   apply for all channels and override all other stepSize/windowSize
 *   configurations.
 *
 * @param[in] chIdx
 *   An identifier of the scan channel. A valid range is 0-15.
 *
 * @param[in] windowSize
 *   A window size to be used on all channels.
 *
 * @param[in] initValue
 *   The initial sensor value for the channel.
 ******************************************************************************/
void LESENSE_ChannelSlidingWindow(uint8_t chIdx,
                                  uint32_t windowSize,
                                  uint32_t initValue)
{
  LESENSE_CH_TypeDef * ch = &LESENSE->CH[chIdx];
#if defined(_SILICON_LABS_32B_SERIES_2)
  bool enabled = false;
#endif

  LESENSE_WindowSizeSet(windowSize);

#if defined(_SILICON_LABS_32B_SERIES_0) || defined(_SILICON_LABS_32B_SERIES_1)
  ch->EVAL = (ch->EVAL & ~(_LESENSE_CH_EVAL_COMPTHRES_MASK | _LESENSE_CH_EVAL_MODE_MASK))
             | (initValue << _LESENSE_CH_EVAL_COMPTHRES_SHIFT)
             | LESENSE_CH_EVAL_MODE_SLIDINGWIN;
#else

  if (LESENSE->EN != 0U) {
    enabled = true;
    /* Wait for synchronization before writing to EN register */
    while (LESENSE->SYNCBUSY) {
      /* Wait for all synchronizations to finish */
    }
    /* Disable LESENSE module */
    LESENSE->EN_CLR = LESENSE_EN_EN;
    while (LESENSE->EN & _LESENSE_EN_DISABLING_MASK) {
      /* Wait for disabling to finish */
    }
  }

